// Задана последовательность натуральных чисел, завершающаяся числом 0. 
// Требуется определить значение второго по величине элемента в этой последовательности, 
// то есть элемента, который будет наибольшим, 
// если из последовательности удалить наибольший элемент.

// Входные данные
// Входной файл содержит последовательность неотрицательных целых чисел, 
// не превышающих значения 100. 
// Гарантируется, что во входных данных не более 100 чисел и среди них есть хотя бы одно число 0,
// перед которым идет как минимум 2 элемента.

// Выведите целое число – значение второго максимума.

Console.Clear();
